0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


Ustar                0.30758393542;
Uref                 8.85297730678;
Href                 3000;
z0                   0.03;
windDirection        (-1.0 6.12323399574e-17 0);
zDirection           (0 0 1);
zGround              uniform 0;

// ************************************************************************* //

