0/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volScalarField; 	
 location "0"; 	
 object nut; 	
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0; 	

boundaryField
{
  inlet
  {
    type calculated;
    value uniform 0; 	
  }
  outlet
  {
    type calculated;
    value uniform 0; 	
  } 	
  "terrain_.*"
  {
    type nutkRoughWallFunction;
    Ks uniform 0.5874; 	
    Cs uniform 0.5; 	
    kappa 0.4; 	
    Cmu 0.03; 	
    value uniform 0.0; 	
  }
  ground
  {
    type nutkRoughWallFunction;
    Ks uniform 0.5874; 	
    Cs uniform 0.5; 	
    kappa 0.4; 	
    Cmu 0.03; 	
    value uniform 0.0; 	
  } 	
  top
  {
    type calculated;
    value uniform 0; 	
  } 	
#include "include/sideAndTopPatches"
} 	// ************************************************************************* //

